[
  {
    "id": 1,
    "experiencePeriod": "June 2022 - Present",
    "experienceTitle": "Early Childhood Educator (Director Approved)",
    "experienceLocation": "Kidsfirst Childcare Centre, Oshawa",
    "highlights": [
      "Facilitated engaging and age-appropriate learning activities for children aged 2-4 years, promoting physical, social, emotional, and cognitive development.",
      "Developed and implemented daily lesson plans, tailored to individual needs and interests, fostering a positive and inclusive learning environment.",
      "Observed and assessed children's progress, identifying areas for improvement and providing support and encouragement.",
      "Experienced in providing care to children with different abilities",
      "Created and maintained a safe and clean classroom, adhering to health and safety regulations and guidelines.",
      "Participated in staff meetings and professional development workshops to stay abreast of best practices and advancements in early childhood education.",
      "Collaborated with parents and caregivers, maintaining open lines of communication to ensure consistent care and alignment between home and school environments.",
      "Managed digital communication using HiMama app"
    ]
  },
  {
    "id": 2,
    "experiencePeriod": "April 2022 - June 2022",
    "experienceTitle": "Early Childhood Assistant",
    "experienceLocation": "Tiny Hoppers Daycare, Oshawa",
    "highlights": [
      "Planned and implemented a consistent child-centered program.",
      "Participated in and applied learnings from research to children's learning",
      "Completed required documentation of children's development and interaction digitally",
      "Experience in providing care to children with developmental issues",
      "Established positive and productive relationships with families.",
      "Managed digital communication using Sandbox app"
    ]
  },
  {
    "id": 3,
    "experiencePeriod": "August 2021 - November 2021",
    "experienceTitle": "Early Childhood Assistant - Intern",
    "experienceLocation": "Small Wunders, Mississauga",
    "highlights": [
      "Maintained a safe and healthy learning environment that promoted the positive development of children.",
      "Provided developmentally appropriate curriculum that promoted the physical and intellectual growth of children.",
      "Assisted in providing positive guidance that supported the social and emotional development of children."
    ]
  }
]
