[
  {
    "id": 1,
    "experiencePeriod": "March 2016 - Present",
    "experienceTitle": "Manager - Projects",
    "experienceLocation": "Cognizant Technology Solutions:- San Antonio, Texas, Mississauga, Canada",
    "highlights": [
      "Leading customer's Legacy Development Center portfolio, with the goal to serve the business functional enhancement needs for various LOBs. Working very closely with business and IT stakeholders of the customer organization.",
      "Evaluating current business processes, procedures and work practices and proposing overarching solutions to complex problems",
      "Participate in enterprise architecture workshops and assessments to prepare long term vision statement of the client IT organization"
    ]
    },
  {
    "id": 2,
    "experiencePeriod": "April 2011 - March 2016",
    "experienceTitle": "Senior Associate - Projects",
    "experienceLocation": "Cognizant Technology Solutions:- San Antonio, Texas",
    "highlights": [
      "Lead the Cognizant team working in customer's Integration Competency Center division. This was a multi-technology team involving mainframe and TIBCO.",
      "Garnered $4M savings by avoiding a Mainframe CPU upgrade; fine-tuned the usage of CPU cycles by TIBCO integrations",
      "Designed and implemented a near real time application that feeds master data, retail and cost changes to downstream systems (eCommerce, Brick and Mortar stores, BI etc) positioning business to make real time adjustments to match competitors and improve store operation efficiency"
    ]

  },
  {
    "id": 3,
    "experiencePeriod": "December 2009 - April 2011",
    "experienceTitle": "Associate - Projects",
    "experienceLocation": "Cognizant Technology Solutions:- Chennai, India",
    "highlights": [
      "Senior Mainframe developer reponsible for redesign of various mainframe based applications to consolidate the technology stack and move to a common database management system.",
      "Creating a detailed technical design specification based on functional and non-functional requirements using data and process modelling techniques."
    ]

  },
  {
    "id": 4,
    "experiencePeriod": "September 2006 - December 2009",
    "experienceTitle": "Senior Software Engineer",
    "experienceLocation": "Infosys Technologies Ltd",
    "highlights": [
      "Creating the business case and assessing desirability of the solution, by performing a cost benefit analysis",
      "Delivering elements of systems design, including data migration rules, business rules, wireframes, or other detailed deliverables"
    ]

  }
]
